from translate import ContentTranslator

phrases = [
    "Happy birthday bb ของพี่ 🦦🤏🏻 20 ขวบแล้ว ขอให้หนูมีความสุข เติบโตในแบบที่หนูอยากจะเป็น สมหวังในทุกๆเรื่อง แต่ถ้าวันนึงมีเรื่องไหนที่ไม่เป็นไปตามที่หนูหวัง ก็ไม่เป็นไรเพราะหนูจะมีพี่อยู่ข้างๆเสมอ ขอให้สุขภาพแข็งแรงไม่เจ็บไม่ป่วย ไม่ซนไม่ดื้อ รักรัก 🤍",
    "น่ายักกกอะะะ",
    "ขอบคุณนะคะที่เดินทางด้วยกันมาตลอด อยากให้ทุกคนอยู่ด้วยกันไปเรื่อยๆ ผ่านทุกๆเรื่องราวไปด้วยกัน วันนี้วันก่อนเป็นแบบไหนวันหน้าๆฟรีนก็เป็นแบบนั้น จะอยู่ข้างๆทุกคนเสมอเหมือนเดิม จะคอยเป็นกำลังใจให้ในทุกๆเรื่องนะคะ รักรักที่สุดเลย 🫶🏻✨🥰🌷🦋💗 ",
    "แฟนสามชื่อม่อน😌",
    "แงงง ภูมิใจจังเลยคนเก่ง ดีใจที่มีคนรักเยอะมากๆเลยย🥺🤏🏻💖 รอฉลอง1Mแล้วนะ น่ารักยังงี้ไปนานๆเลยนะคะ หนูก้จะอยู่ข้างๆพี่เสมอแบบนี้ยะ จะเป็นเด็กคนนึงที่ทำให้พีมีรอยยิ้มในวันทีฝนตกในใจนะคะ รักขนาดไหนคงไม่ต้องบอกน่าจะรู้🤍",
    "น่ารักwaaaaaขอบคุณนะคะยัยหนู เติบโตด้วยกันนะรอฉลองยูทู ไปกิงสุกี้ด้วยกันสักที!! 🤪🤏🏻🤍",
    "เตรียมทิชชู่ยังงง🥺 ",
    "Awwwwwwhhhh 200k 🫶🏻🦋💘 Thank you all naka 🪄 ขอบคุณทุกคนที่อยู่ในทุกช่วงเวลากับเราจนตอนนี้และต่อๆไป อย่าลืมว่าความสุขอยู่รอบตัวเรานะคะ อยู่ข้างๆเสมอเหมือนกันค่ะ เลิ้ฟฟฟยู้วววว luv uuu 🌷✨🤏🏻🫧",
    "หนูเจ็บอะมามี้💔",
    "ฟามโส้ยยยยยยยย",
    "400k 🧸☺️💖 ครอบครัวเราค่อยๆโตขึ้นแล้วนะ ใจฟูสุดๆเลย🥰 อยู่ด้วยกันไปนานๆเลยนะคะ หนูจะเป็นทั้งน้องพุงเด็กแสบของมามี้ แล้วพี่เบคของฮันนี่ตลอดไปเลยนะคะ😛 รักนะคะ รักมากๆเลยยย รักเม่าโลกเลยฮือออ🥺🥺🥺❤️",
    "แม้ว่าจะ1k100kหรือ1M หนูก้จะเป็นน้องเบคน้องพุงคนเดิมที่จะทำให้มามี้ฮ้นนี่หนูมีรอยยิ้มทุกวันเลย🥹ขอบคุณจากหัวใจเลยนะคะ ไม่เคยคิดเลยว่านุจะมีคนรักขนาดนี้หนูเป็นคนพูดไม่เก่งแต่รักสุดหัวใจแน่นอน อาจะยังไม่เก่ง100%แต่จะไม่พยุดพัฒนาตัวเอง🫶เติบโตไปด้วนกันนะคะ",
    "กลับถึงบ้านอะยังงวันนี้ไม่รู้จะขอบคุณยังไงเลยใจฟูมากๆครอบครัวเราเติบโตขึ้นแล้วนะ🥹ดีใจมากๆเลยนะคะที่ได้เจอมามี้ฮันนี่ของหนูจากวันแรกถึงตอนนี้ทุกคนน่ารักเสมอเลยถ้าวันนี้หนูไม่ได้ยินใครนุขอโทษด้วยนะงับพยายามฟังสุดหัวใจยะรักเม่าโลกเลยนะคะ🫶จับมือกันไปนานๆเลยนะ🥹",
    "Awwwww🥹 ขอบคุณนะคะคนเก่งของหนู เราผ่านอะไรด้วยกันมาเยอะมากๆ แล้วเชื่อว่าจะเจออีกหลายๆอย่างที่จะต้องจับมือแน่นๆไว้🫶 ขอให้มีแต่คนรักแล้วเอ็นดูฟรีนกี้ของนุด้วยนะ เติบโตไปด้วยกันนะคะ หนูไม่ไปไหนอยู่แล้ว ถ้าวันไหนไม่มีใครมองมาทางนี้ก้มีนุคนนึงนะคับ☺️ ps: ไปต่อยมวยกันค่า😛",
    "ไม่ส่งรูปให้นุบ้างเลยยยยยยยย งอน (ง้อด้วย)🥹",
    "🥹🫶💖 รักเม่าโลกกว่านะคะ~ #400Kรักน้องพุงเม่าโลก",
]


def main():
    trans = ContentTranslator()
    # for text in phrases:
    #     print(trans.translate_text(text), "\n")
    trans.translate_image(
        "https://pbs.twimg.com/media/FTdDgV5acAEqohP?format=jpg&name=large"
    )


if __name__ == "__main__":
    main()
